logs/fio-diskseq/Strato 4v 8GB/000/log009.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;522101;2039;32134;0;0;0.000000;0.000000;67;187577;482.840281;2275.642847;1.000000%=70;5.000000%=71;10.000000%=73;20.000000%=75;30.000000%=77;40.000000%=82;50.000000%=86;60.000000%=91;70.000000%=103;80.000000%=116;90.000000%=136;95.000000%=173;99.000000%=13434;99.500000%=14090;99.900000%=14483;99.950000%=14614;99.990000%=17694;0%=0;0%=0;0%=0;69;187580;484.737342;2275.641553;349696;1763328;100.000000%;522464.000000;176856.101535;0.746896%;20.300003%;2280;0;15;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;67.45%;28.98%;0.14%;0.02%;0.01%;0.01%;0.01%;1.55%;1.84%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;13319;0;20;0;1472700;1472702;97.89%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3487: Mon Jan  8 14:09:50 2024
  write: IOPS=2039, BW=510MiB/s (535MB/s)(16.0GiB/32134msec); 0 zone resets
    clat (usec): min=67, max=187577, avg=482.84, stdev=2275.64
     lat (usec): min=69, max=187580, avg=484.74, stdev=2275.64
    clat percentiles (usec):
     |  1.00th=[   71],  5.00th=[   72], 10.00th=[   74], 20.00th=[   76],
     | 30.00th=[   78], 40.00th=[   83], 50.00th=[   87], 60.00th=[   92],
     | 70.00th=[  104], 80.00th=[  117], 90.00th=[  137], 95.00th=[  174],
     | 99.00th=[13435], 99.50th=[14091], 99.90th=[14484], 99.95th=[14615],
     | 99.99th=[17695]
   bw (  KiB/s): min=349696, max=1763328, per=100.00%, avg=522464.00, stdev=176856.10, samples=64
   iops        : min= 1366, max= 6888, avg=2040.88, stdev=690.84, samples=64
  lat (usec)   : 100=67.45%, 250=28.98%, 500=0.14%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=1.55%, 20=1.84%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.75%, sys=20.30%, ctx=2280, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=510MiB/s (535MB/s), 510MiB/s-510MiB/s (535MB/s-535MB/s), io=16.0GiB (17.2GB), run=32134-32134msec

Disk stats (read/write):
  vda: ios=0/13319, merge=0/20, ticks=0/1472700, in_queue=1472702, util=97.89%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;484932;1894;34597;0;0;0.000000;0.000000;59;2906;521.586906;73.166958;1.000000%=317;5.000000%=436;10.000000%=456;20.000000%=485;30.000000%=501;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=561;90.000000%=585;95.000000%=602;99.000000%=675;99.500000%=733;99.900000%=1089;99.950000%=1384;99.990000%=2310;0%=0;0%=0;0%=0;59;2906;521.706148;73.164443;257024;488960;100.000000%;485242.434783;27879.280447;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.459591%;17.146491%;65422;0;75;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.27%;0.47%;26.97%;71.88%;0.27%;0.13%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65142;1099;0;4;62550;66551;129101;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=3490: Mon Jan  8 14:10:25 2024
  read: IOPS=1894, BW=474MiB/s (497MB/s)(16.0GiB/34597msec)
    clat (usec): min=59, max=2906, avg=521.59, stdev=73.17
     lat (usec): min=59, max=2906, avg=521.71, stdev=73.16
    clat percentiles (usec):
     |  1.00th=[  318],  5.00th=[  437], 10.00th=[  457], 20.00th=[  486],
     | 30.00th=[  502], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  562], 90.00th=[  586], 95.00th=[  603],
     | 99.00th=[  676], 99.50th=[  734], 99.90th=[ 1090], 99.95th=[ 1385],
     | 99.99th=[ 2311]
   bw (  KiB/s): min=257024, max=488960, per=100.00%, avg=485242.43, stdev=27879.28, samples=69
   iops        : min= 1004, max= 1910, avg=1895.48, stdev=108.90, samples=69
  lat (usec)   : 100=0.27%, 250=0.47%, 500=26.97%, 750=71.88%, 1000=0.27%
  lat (msec)   : 2=0.13%, 4=0.01%
  cpu          : usr=0.46%, sys=17.15%, ctx=65422, majf=0, minf=75
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=474MiB/s (497MB/s), 474MiB/s-474MiB/s (497MB/s-497MB/s), io=16.0GiB (17.2GB), run=34597-34597msec

Disk stats (read/write):
  vda: ios=65142/1099, merge=0/4, ticks=62550/66551, in_queue=129101, util=100.00%